---
kind: method
id: M:Autodesk.Revit.Creation.Application.NewColor
source: html/52f947d5-3aca-fb6a-d768-7499dbe74852.htm
---
# Autodesk.Revit.Creation.Application.NewColor Method

Returns a new color object.

## Syntax (C#)
```csharp
public Color NewColor()
```

## Returns
The new color object.